Feature: Смяна на пин код
    
    Scenario: Смяна на пин код
    Given Потребителят поставя кредитна/дебитна карта с номер "asd123" в банкомата , с цел смяна на пин
    When Въведе стар пин код "1234"
    And Въведе нов пин код "54654"
    And Натисне бутона за смяна на пин код
    Then Показва съобщение "Смяната на паролата беше успешна"
    
   Scenario: Смяна на пин код , когато стария пин е същия като новия
    Given Потребителят поставя кредитна/дебитна карта с номер "asd123" в банкомата , с цел смяна на пин
    When Въведе стар пин код "1234"
    And Въведе нов пин код "1234"
    And Натисне бутона за смяна на пин код
    Then Показва съобщение "Смяната на паролата беше неуспешна,не може новата и старата парола да са еднакви"
    
