Feature: Теглене на пари

  Scenario: Теглене на пари от банкомат с валидни данни
    Given Потребителят поставя кредитна/дебитна карта с номер "asd123" в банкомата
    When Избере сума "122"
    And Въведе пин код "1234"
    And Натисне бутона за потвърждение
    Then Показване на съобщение "Успешна транзакция"
    
   Scenario: Теглене на пари от банкомат с невалиден пин код
    Given Потребителят поставя кредитна/дебитна карта с номер "asd123" в банкомата
    When Избере сума "222"
    And Въведе пин код "1233"
    And Натисне бутона за потвърждение
    Then Показване на съобщение "Невалиден пин код"
    
   Scenario: Теглене на пари от банкомат с недостик на средства
    Given Потребителят поставя кредитна/дебитна карта с номер "asd123" в банкомата
    When Избере сума "5345434"
    And Въведе пин код "1234"
    And Натисне бутона за потвърждение
    Then Показване на съобщение "Недостик на средства"
    